<a href="https://colab.research.google.com/github/merriekay/CS167Code/blob/main/Day03_Exercises_Solution.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

An example of a markdown cell<br>
Author: <b>Your name here</b><br>
Date: February 4, 2020
# Python and Pandas Exercises

In [ ]:
#selecting columns in dataframes
import pandas
titanic = pandas.read_csv("titanic.csv")

In [ ]:
# what is the data type of titanic?
print(type(titanic))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
# what are the features (column titles) of the titanic dataset?
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [ ]:
# display only the 'embark_town' column of the titanic data
titanic["embark_town"]

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [ ]:
# what is the data type of the result of the previous cell? 
type(titanic["embark_town"])

pandas.core.series.Series

In [ ]:
# what is the "shape" of the data frame?
titanic.shape

(891, 15)

In [ ]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data;
# verify that your subset has 20 rows
subset = titanic[871:]
subset.shape[0]

20

In [ ]:
# use loc to print out the data for passenger 890 on the titanic dataframe
# use iloc to print out the data for passenger 890 on the subest dataframe
print(titanic.loc[890])
subset.iloc[-1] #-1 grabs the last index, but subset.iloc[19] would also work
subset.iloc[19]

survived                0
pclass                  3
sex                  male
age                    32
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

survived                0
pclass                  3
sex                  male
age                    32
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

# use a markdown cell; describe the difference between loc and iloc
Loc refers to the original name of the row (in this case the overall index), however, iloc refers to the relative index. 

While referring to the whole dataset, loc and iloc of the same integer will refer to the same row, but as soon as you start using subsets, iloc will use the indices that are relative to your subset, and loc will use the original indexes that were set when the csv file was read into the notebook.

In [ ]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with
# a 'embark_town' that is "Queenstown"
# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using 
# the .copy() function
queenstown_subset = titanic[titanic["embark_town"]=='Queenstown']

In [ ]:
# how many passengers are in queenstown_subset?
queenstown_subset.shape[0]

77

In [ ]:
# what is the average fare for all of those in the queenstown_subset?
queenstown_subset['fare'].mean()

13.276029870129872

In [ ]:
# what is the average age for all of those in the queenstown_subset?
queenstown_subset['age'].mean()
# do all of the passengers have an age recorded? What is recorded if there is no age?
queenstown_subset['age'].isna()   #we can use this and see where the first NA row is, we see that 5 doesn't have any recorded age.
queenstown_subset['age'].loc[5]   #we can get the value of the age of the peron in row 5 to see that it's recorded as nan

nan

In [ ]:
# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

#unique()
print(titanic['embark_town'].unique()) #unique() prints the unique values in order or appearance

#mean()
print(queenstown_subset['age'].mean()) #mean() takes the average of a numeric series

#isnull()
print(queenstown_subset['age'].isnull())  #isnull() returns a boolean series which indicates whether or not values are missing

#fillna(): will replace missing values with whatever you'd like.

['Southampton' 'Cherbourg' 'Queenstown' nan]
28.089285714285715
5       True
16     False
22     False
28      True
32      True
       ...
790     True
825     True
828     True
885    False
890    False
Name: age, Length: 77, dtype: bool
5      28.089286
16      2.000000
22     15.000000
28     28.089286
32     28.089286
         ...
790    28.089286
825    28.089286
828    28.089286
885    39.000000
890    32.000000
Name: age, Length: 77, dtype: float64

In [ ]:
# give examples of your use of unique(), mean(), median(), isnull()
#See above.
titanic['deck'].unique()
titanic['age'].mean()
titanic['age'].median()
titanic['deck'].isnull()

0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: deck, Length: 891, dtype: bool

In [ ]:
# in the queenstown_subet dataframe
# for each row that does not have an age recorded, replace the NaN value with the calculated average
# hint: don't use a loop; it can be done in 1 line of code using fillna()
queenstown_subset['age'].fillna(queenstown_subset['age'].mean())

In [ ]:
# load in the iris data
iris = pandas.read_csv('irisData.csv')
iris

     sepal length  sepal width  petal length  petal width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [ ]:
# what is the median sepal width of just the Setosas?
sentosas = iris[iris['species'] == 'Iris-setosa']
sentosas['sepal width'].median()

3.4

In [ ]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?
big_petal_versicolors = iris[(iris['species']=='Iris-versicolor')&(iris['petal length']>4)]
big_petal_versicolors['sepal width'].mean()

2.902941176470588